base-case/curiosityFluidsAirfoilMesher/setup3-again/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    farfield
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    airfoil
    {
        type            calculated;
        value           nonuniform List<vector> 
341
(
(-16.6696 -0.420506 2.02846e-25)
(-16.8349 -0.426911 -3.43619e-26)
(-17.0171 -0.291232 9.71581e-24)
(-17.1394 -0.167312 -3.09952e-42)
(-17.3395 -0.127523 -1.171e-25)
(-17.6161 -0.0777635 -1.18639e-25)
(-17.8918 -0.0262598 6.11724e-26)
(-18.2034 0.0408703 1.19325e-25)
...
)
;
    }
}


// ************************************************************************* //
